{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [166, 166], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [166], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [166, 322], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [322], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [322, 322], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [322], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [322, 1], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [1], "dtype": "float32"}]}]}