{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.5.2", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_10/kernel", "shape": [136, 136], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [136], "dtype": "float32"}, {"name": "dense_11/kernel", "shape": [136, 136], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [136], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [136, 1], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [1], "dtype": "float32"}]}]}